congresso/app/Controllers/Ajax.php

SELECT `paragrafo`
FROM `congresso_caderno`
WHERE `nr_paragrafo` = '42'
---
    public function index()
    {
        session();
        $this->cadernoModel = new CadernoModel();
        $this->emendasModel = new EmendasModel();

        $cod_usu = $_SESSION['cod_usu'];
        $user_nivel = $_SESSION['user_nivel'];
        $nr_paragrafo = $this->request->getPost('nr_paragrafo');

        if($user_nivel == 1) {
            $paragrafo = $this->cadernoModel->where('nr_paragrafo', $nr_paragrafo)
                                            ->select('congresso_caderno.paragrafo, congresso_caderno.titulo, congresso_caderno.img_01,congresso_caderno.img_02, congresso_caderno.img_03')
                                            ->find();