congresso/app/Controllers/Configurar.php

SELECT *
FROM `congresso_eventos`
WHERE `id` = '96'
---
    public function editEvento()
    {
        $title = "Editar evento";
        $evento = $this->request->getPost('id');
        $dados = $this->eventosModel->where('id', $evento)->join('nucleo', 'congresso_eventos.nucleo = nucleo.codigo', 'left')->select('congresso_eventos.*')->select('nucleo.nucleo as nomeNucleo')->find();
        echo view('layout/header', ['title' => $title]);
        echo view('configuracoes/config_editEvento', [  'dados'   => $dados,
                                        'nucleos' => $this->nucleoModel->find()]);